```text
groovy:000> 2+2
===> 4
groovy:000> Sytem.out.println("Feeling Groovy?")
Feeling Groogy
===> null
```

```text
groovy:000> age = 35
===> 35
groovy:000> println "You are " + age + " years old"
You are 35 years old
===> null
```